# Pandas

- Pandas ia an open source python library provinding high-performance data manipulation and data analysis 

### Key points in pandas:

 - Fast and Efficient 
 - Tools for loading data into memory data objects from different file formats.(ex:.csv,.excel,.html,.txt))
 - Data alignment and integrated handling of missing data.
 
 - there are two data structures:
 
     - Series
     - DataFrame
     
#### Series:

 - series is one dimensional array-like object containing a sequence of values and associated with array of data lables,called its index
 
 #### DataFrame:
 
- DataFrame looks like a table of data

In [12]:
import pandas as pd

In [13]:
n=list("srmuniversity")
ds=pd.Series(n)
ds

0     s
1     r
2     m
3     u
4     n
5     i
6     v
7     e
8     r
9     s
10    i
11    t
12    y
dtype: object

In [14]:
import numpy as np

In [19]:
arr = np.array([1,2,3,4,5,np.nan])
ds1=pd.Series(arr)
ds1

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    NaN
dtype: float64

### creating a series with dictionary

In [20]:
d = {"course":"python","college":"srm","students":97,"fee":np.nan}
d

{'course': 'python', 'college': 'srm', 'students': 97, 'fee': nan}

In [21]:
ds2 = pd.Series(d)
ds2

course      python
college        srm
students        97
fee            NaN
dtype: object

#### Data Frame with dictionary and numpy

In [92]:
arr

array([ 1.,  2.,  3.,  4.,  5., nan])

In [25]:
df1 = pd.DataFrame(arr)
df1

     0
0  1.0
1  2.0
2  3.0
3  4.0
4  5.0
5  NaN

In [26]:
n

['s', 'r', 'm', 'u', 'n', 'i', 'v', 'e', 'r', 's', 'i', 't', 'y']

In [27]:
df2 = pd.DataFrame(n)
df2

    0
0   s
1   r
2   m
3   u
4   n
5   i
6   v
7   e
8   r
9   s
10  i
11  t
12  y

In [28]:
d

{'course': 'python', 'college': 'srm', 'students': 97, 'fee': nan}

In [30]:
d.keys()

dict_keys(['course', 'college', 'students', 'fee'])

In [31]:
df3 = pd.DataFrame(d,index=d.keys())
df3

          course college  students  fee
course    python     srm        97  NaN
college   python     srm        97  NaN
students  python     srm        97  NaN
fee       python     srm        97  NaN

In [32]:
df3.index=[1,2,3,4]
df3

   course college  students  fee
1  python     srm        97  NaN
2  python     srm        97  NaN
3  python     srm        97  NaN
4  python     srm        97  NaN

In [40]:
d1 = {"names":["a","b","c"],"marks":[23,45,67],"grade":["A","A+","C"]}
df4 = pd.DataFrame(d1)
df4.index=[1,2,3]
df4

  names  marks grade
1     a     23     A
2     b     45    A+
3     c     67     C

## accesing values, index

In [42]:
ds.values

array(['s', 'r', 'm', 'u', 'n', 'i', 'v', 'e', 'r', 's', 'i', 't', 'y'],
      dtype=object)

In [43]:
ds.index

RangeIndex(start=0, stop=13, step=1)

In [44]:
df4.values

array([['a', 23, 'A'],
       ['b', 45, 'A+'],
       ['c', 67, 'C']], dtype=object)

In [45]:
df4.index

Int64Index([1, 2, 3], dtype='int64')

In [48]:
df4.columns

Index(['names', 'marks', 'grade'], dtype='object')

In [52]:
# Accessing series data using indexing
ds[5]

'i'

In [54]:
df4

  names  marks grade
1     a     23     A
2     b     45    A+
3     c     67     C

In [55]:
df4["names"][2]

'b'

In [56]:
df4["grade"][3]

'C'

### Masking

In [91]:
df4[df4["marks"]>30]["names"]

2    b
3    c
Name: names, dtype: object

In [62]:
d["names"]

2    b
3    c
Name: names, dtype: object

In [63]:
ds1

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    NaN
dtype: float64

In [64]:
ds1>1

0    False
1     True
2     True
3     True
4     True
5    False
dtype: bool

### isnull,notnull,isna,notna

In [65]:
arr

array([ 1.,  2.,  3.,  4.,  5., nan])

In [67]:
ds1

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    NaN
dtype: float64

In [83]:
ds1.isnull()

0    False
1    False
2    False
3    False
4    False
5     True
dtype: bool

In [84]:
df4.isna()

   names  marks  grade
1  False  False  False
2  False  False  False
3  False  False  False

In [71]:
df4

  names  marks grade
1     a     23     A
2     b     45    A+
3     c     67     C

In [72]:
df4.notna()

   names  marks  grade
1   True   True   True
2   True   True   True
3   True   True   True

### count of missing values

In [76]:
ds1.isna().sum()

1

In [77]:
arr1 = np.array([1,2,3,np.nan,np.nan])
ds3 = pd.Series(arr1)
ds3

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
dtype: float64

In [79]:
ds3.isna().sum()

2

In [80]:
ds1

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    NaN
dtype: float64